app/controllers/elections_controller.rb

  def index
    @elections = Election.all
---
SELECT "elections".* FROM "elections"

  def create
    @election = Election.new(election_params)

    respond_to do |format|
      if @election.save
---
INSERT INTO "elections" ("name", "email", "password", "date_of_birth", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_election
      @election = Election.find(params[:id])
---
SELECT "elections".* FROM "elections" WHERE "elections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]