app/controllers/hospitals_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT "hospitals".* FROM "hospitals"

  def create
    @hospital = Hospital.new(hospital_params)

    respond_to do |format|
      if @hospital.save
---
INSERT INTO "hospitals" ("name", "service", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "aditya"], ["service", "Heart specialits"], ["created_at", "2022-01-13 11:15:09.725366"], ["updated_at", "2022-01-13 11:15:09.725366"]]

  def destroy
    @hospital.destroy
---
DELETE FROM "hospitals" WHERE "hospitals"."id" = $1  [["id", 1]]

    def set_hospital
      @hospital = Hospital.find(params[:id])
---
SELECT "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]