app/controllers/ponies_controller.rb

  def index
    @ponies = Pony.all
---
SELECT "ponies".* FROM "ponies"

  def create
    @pony = Pony.new(pony_params)

    respond_to do |format|
      if @pony.save
---
INSERT INTO "ponies" ("name", "profession", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ajay"], ["profession", "Developer"], ["created_at", "2022-01-16 14:57:29.598252"], ["updated_at", "2022-01-16 14:57:29.598252"]]

    def set_pony
      @pony = Pony.find(params[:id])
---
SELECT "ponies".* FROM "ponies" WHERE "ponies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]